docs/nodejs-stack.html
<!doctype html>
<html>
  <head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1" />
  <link rel="stylesheet" href="/assets/style/style.css" type="text/css" />
  <title>nodejs技术栈</title>
</head>

  <body>
    <header class='header'>
  <a class="logo" href="./">home</a>
  <nav>
  </nav>
  <nav>
    <a href="/about.html">about</a>
    <a href="https://github.com/ctlaltlaltc">github</a>
  </nav>

</header>

    <div class="container">
      <h1 class="title">nodejs技术栈
        <br>
        <span class="subtitle"></span>
      </h1>
      <ul class="tags">
        
        <li><a href="/tags/nodejs">nodejs</a></li>
        
      </ul>
      <blockquote><p id="dictum"></p></blockquote>
      <div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
javascript的全栈生态
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
html,css,javascrit号称网页三剑客，在以前的技术位置这三剑客仅限于前端工程师的技术栈。 在nodejs出现之后，javascrit的胶水语言瞬间变成前后端并用的全栈语言，前端工程师不在仅仅只 写前端的DOM控制，现在他们写javascrit也可以像后端的python,ruby,php一样写丰富的后台服务应用。并 且想想，如果解决方案前后端都选择javascrit来维护和架构，那么项目中的学习和维护成本就变得 简单即是好的。</p>
<p>
全栈工程师，也叫全端工程师，英文Full Stack developer。是指掌握多种技能，并能利用多种技 能独立完成产品的人。在我看来做科技产品的话那就是软硬件都有的技能，前台能设计界面，后台能写 服务程序，能定制特定需求高性能等，并能独立开发出demo产品，但现在更多的互联网产品，因此独立完成 一个web产品,前后端兼施的技能也可以称为Full Stack developer.</p>
<p>
当然我不是全栈工程师，只是想体验一下O_o</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
使用nodejs做一个curd后台服务
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<ul>
<li>
<p>建立一个app的package.json，就可以使用npm安装技术栈</p>
<p>
<code>emacs package.json</code></p>
<div class="src src-json">
<div class="highlight">
<pre style="background-color:#fff">{
  <span style="color:#000080">&#34;name&#34;</span>: <span style="color:#d14">&#34;curd-app&#34;</span>,
  <span style="color:#000080">&#34;version&#34;</span>: <span style="color:#d14">&#34;0.01&#34;</span>
}</pre>
</div>
</div>
<p>
命令行安装koa，一个小而美的框架</p>
<div class="src src-sh">
<div class="highlight">
<pre style="background-color:#fff">  npm install koa --save</pre>
</div>
</div>
</li>
<li>
<p>koa 的hello,world. O_o</p>
<p>
新建一个 <code>app.js</code> , 运行 <code>node app.js</code> ,浏览器访问 <a href="http://localhost:3000">http://localhost:3000</a> 就会出现hello world.</p>
<div class="src src-js">
<div class="highlight">
<pre style="background-color:#fff">  <span style="color:#000;font-weight:bold">var</span> koa <span style="color:#000;font-weight:bold">=</span> require(<span style="color:#d14">&#39;koa&#39;</span>);
  <span style="color:#000;font-weight:bold">var</span> app <span style="color:#000;font-weight:bold">=</span> koa();
  app.use(<span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>() {
   <span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Hello World&#39;</span>;
  });
  app.listen(<span style="color:#099">3000</span>);
</pre>
</div>
</div>
</li>
<li>
<p>为hello world的访问添加日志，这需要添加一个中间件</p>
<div class="src src-sh">
<div class="highlight">
<pre style="background-color:#fff">  npm install koa-logger --save</pre>
</div>
</div>
<p>
修改hello world</p>
<div class="src src-js">
<div class="highlight">
<pre style="background-color:#fff">  <span style="color:#000;font-weight:bold">var</span> koa <span style="color:#000;font-weight:bold">=</span> require(<span style="color:#d14">&#39;koa&#39;</span>);
  <span style="color:#000;font-weight:bold">var</span> app <span style="color:#000;font-weight:bold">=</span> koa();
  <span style="color:#000;font-weight:bold">var</span> logger <span style="color:#000;font-weight:bold">=</span> require(<span style="color:#d14">&#39;koa-logger&#39;</span>);
  app.use(logger());
  app.use(<span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>() {
   <span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Hello World&#39;</span>;
  });
  app.listen(<span style="color:#099">3000</span>);
</pre>
</div>
</div>
<p>
这时浏览器再次访问hello world后台就会打印访问日志信息</p>
<pre class="example">
&lt;-- GET /
--&gt; GET / 200 139ms -
&lt;-- GET /favicon.ico
--&gt; GET /favicon.ico 200 6ms -
</pre>
</li>
<li>
<p>实现CURD功能，这需要添加一个路由中间件</p>
<div class="src src-sh">
<div class="highlight">
<pre style="background-color:#fff">  npm install koa-route --save</pre>
</div>
</div>
<p>
修改hello world</p>
<div class="src src-js">
<div class="highlight">
<pre style="background-color:#fff">  <span style="color:#000;font-weight:bold">var</span> koa <span style="color:#000;font-weight:bold">=</span> require(<span style="color:#d14">&#39;koa&#39;</span>);
  <span style="color:#000;font-weight:bold">var</span> app <span style="color:#000;font-weight:bold">=</span> koa();
  <span style="color:#000;font-weight:bold">var</span> logger <span style="color:#000;font-weight:bold">=</span> require(<span style="color:#d14">&#39;koa-logger&#39;</span>);
  <span style="color:#000;font-weight:bold">var</span> route <span style="color:#000;font-weight:bold">=</span> require(<span style="color:#d14">&#39;koa-route&#39;</span>);
  app.use(logger());
  <span style="color:#998;font-style:italic">// CURD Create,Update,Read,Delete
</span><span style="color:#998;font-style:italic"></span>  app.use(route.get(<span style="color:#d14">&#39;/&#39;</span>, <span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>Read(next) {
<span style="color:#000;font-weight:bold">if</span> (<span style="color:#d14">&#39;GET&#39;</span> <span style="color:#000;font-weight:bold">!=</span> <span style="color:#000;font-weight:bold">this</span>.method) <span style="color:#000;font-weight:bold">return</span> <span style="color:#000;font-weight:bold">yield</span> next;
<span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Read&#39;</span>;
  }));
  app.use(route.post(<span style="color:#d14">&#39;/add/&#39;</span>, <span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>Create(next) {
<span style="color:#000;font-weight:bold">if</span> (<span style="color:#d14">&#39;POST&#39;</span> <span style="color:#000;font-weight:bold">!=</span> <span style="color:#000;font-weight:bold">this</span>.method) <span style="color:#000;font-weight:bold">return</span> <span style="color:#000;font-weight:bold">yield</span> next;
<span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Create&#39;</span>;
  }));
  app.use(route.<span style="color:#000;font-weight:bold">delete</span>(<span style="color:#d14">&#39;/delete/&#39;</span>, <span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>Delete(next) {
<span style="color:#000;font-weight:bold">if</span> (<span style="color:#d14">&#39;DELETE&#39;</span> <span style="color:#000;font-weight:bold">!=</span> <span style="color:#000;font-weight:bold">this</span>.method) <span style="color:#000;font-weight:bold">return</span> <span style="color:#000;font-weight:bold">yield</span> next;
<span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Delete&#39;</span>;
  }));
  app.use(route.put(<span style="color:#d14">&#39;/update&#39;</span>, <span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>Update(next) {
<span style="color:#000;font-weight:bold">if</span> (<span style="color:#d14">&#39;PUT&#39;</span> <span style="color:#000;font-weight:bold">!=</span> <span style="color:#000;font-weight:bold">this</span>.method) <span style="color:#000;font-weight:bold">return</span> <span style="color:#000;font-weight:bold">yield</span> next;
<span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Update&#39;</span>
  }));
  app.use(<span style="color:#000;font-weight:bold">function</span> <span style="color:#000;font-weight:bold">*</span>(next) {
<span style="color:#000;font-weight:bold">this</span>.body <span style="color:#000;font-weight:bold">=</span> <span style="color:#d14">&#39;Hello World&#39;</span>;
  });
  app.listen(<span style="color:#099">3000</span>);
</pre>
</div>
</div>
<p>
运行 <code>nodejs app.js</code> ，这时浏览器分别使用不同的方法访问hello world后台就会打印访问日志信息</p>
<p>
当然有些方法浏览器不好请求，可以找个 REST Client工具进行调试</p>
<pre class="example">
&lt;-- GET /?
--&gt; GET /? 200 9ms -
&lt;-- POST /add
--&gt; POST /add 200 5ms -
&lt;-- PUT /update?
--&gt; PUT /update? 200 2ms -
&lt;-- DELETE /delete?
--&gt; DELETE /delete? 200 16ms -
</pre>
</li>
</ul>
</div>
</div>

    </div>
  </body>
</html>
